[
  {
    "date": "Oct 2021 – Oct 2024",
    "position": "Senior Software Developer Full Stack",
    "description": "Desarrollo del Product Information Manager (PIM), un sistema de gestión de información de productos para plataformas de Cencosud (Marketplace, Paris, Easy), con una base de datos de aproximadamente 2 millones de productos y un tráfico promedio de 500,000 solicitudes por hora. Diseñado bajo un ecosistema composable para facilitar la integración de empresas externas y aplicaciones internas mediante APIs REST y/o event-driven. El sistema incorpora consumidores, importadores, exportadores, cronjobs, lambdas y fargates como elementos integrados en una arquitectura escalable y flexible.",
    "company": "AcidLabs. Cliente: Cencosud",
    "responsibilities": [
      "r0",
      "r1",
      "r2",
      "r3",
      "r4",
      "r5"
    ],
    "location": "Chile",
    "technologies": [
      "t0",
      "t1"
    ]
  },
  {
    "date": "Ago 2018 – Oct 2021",
    "position": "Senior Software Developer Full Stack",
    "description": "Desarrollo de sistema web de telemedicina para Telepraxen, con funcionalidades de gestión de citas, diagnósticos, videoconferencias y chat interno (similar a Microsoft Teams), construido sobre una arquitectura de microservicios.",
    "company": "Telepraxen",
    "responsibilities": [
      "r0",
      "r1",
      "r2"
    ],
    "location": "Alemania/Argentina",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "Ago 2019 – Oct 2020",
    "position": "Senior Software Developer Full Stack",
    "description": "Desarrollo de plataforma para Dual Servicios de logística y transporte de paquetería, que incluye landing page para registro de clientes y sistema de gestión de envíos, sincronizado entre el sistema administrativo y la plataforma de clientes.",
    "company": "Made DEV",
    "responsibilities": [
      "r0",
      "r1",
      "r2"
    ],
    "location": "Costa Rica",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "2018",
    "position": "Senior Software Developer Full Stack",
    "description": "Sistema educativo para Ichimoku Fibonacci, plataforma de cursos online para formación en trading, incluyendo landing page, gestión de cursos y sistema de estudiantes.",
    "company": "Init 10 Development",
    "responsibilities": [
      "r0",
      "r1",
      "r2"
    ],
    "location": "Argentina",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "Oct 2018 – Ago 2019",
    "position": "Senior Software Developer Full Stack",
    "description": "Sistema administrativo para OPE Publicidad, con módulos para registro de solicitudes y presupuestos de proyectos de marketing e impresión.",
    "company": "Made DEV",
    "responsibilities": [
      "r0",
      "r1"
    ],
    "location": "Costa Rica",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "2017 – 2018",
    "position": "Software Developer Full Stack",
    "description": "Sistema GestionaEduca para agilizar el proceso de contratación de personal en colegios alejados geográficamente.",
    "company": "ChileDev",
    "responsibilities": [
      "r0",
      "r1"
    ],
    "location": "Chile",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "2016",
    "position": "Software Developer Full Stack",
    "description": "Sistema administrativo para la gestión de contrataciones y pagos a proveedores de la universidad, usado para dar seguimiento a cada paso de la contratación hasta el pago de la universidad al proveedor.",
    "company": "Universidad Rómulo Gallegos",
    "responsibilities": [
      "r0",
      "r1"
    ],
    "location": "Venezuela",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  },
  {
    "date": "2013",
    "position": "Software Developer Full Stack",
    "description": "Sistema Integral de Información Laboral (SIIL) para la gestión de información de los trabajadores de la universidad, incluyendo sincronización de pagos de nómina y acceso de los empleados a sus recibos y documentos oficiales con verificación por código QR.",
    "company": "Universidad Rómulo Gallegos",
    "responsibilities": [
      "r0",
      "r1"
    ],
    "location": "Venezuela",
    "technologies": [
      "t0",
      "t1",
      "t2",
      "t3"
    ]
  }
]